#!/bin/bash

######################################################################
##### 终端是否可用
######################################################################
if tty 1>/dev/null 2>&1; then
    TerminalBool=1
else
    TerminalBool=0
fi

######################################################################
##### 函数：CoutInfo
#####       往标准输出流里打印信息，同时打印进程号和时间
##### 输入：$@
#####       打印的信息
######################################################################
function CoutInfo
{
    printf "[%05d][%s] : " "$$" "$(date '+%F %T')"
    echo "$@"
}

######################################################################
##### 函数：CerrInfo
#####       往标准错误流里打印信息，同时打印进程号和时间
##### 输入：$@
#####       打印的信息
######################################################################
function CerrInfo
{
    if [ 1 -eq ${TerminalBool} ]; then
        printf "\033[0;31;40m[%05d][%s]\033[0m : " "$$" "$(date '+%F %T')" >/dev/tty
        echo "$@" >/dev/tty
    else
        printf "[%05d][%s] : " "$$" "$(date '+%F %T')" >&2
        echo "$@" >&2
    fi
}

function PutTtyInfo
{
    [ 1 -eq ${TerminalBool} ] && CoutInfo "$@" >/dev/tty
}
